try: 
    print("Привіт, хочеш пограти квест-гру?")
    print("1.Так   2.Ні")
    hp = 100
    a = int(input(""))
    if a == 1:
        print("Ти проснувся у темному лісі, твої дії?")
        print("1.Спати дальше      2.Оглянутись       3.Піти вперед")
        b = int(input(""))
        if b == 1:
            print("Тебе зів медвідь, погана кінцівка.")
        elif b == 2:
            print("Ти озирнувся, згадав, що вчора їхав із друзями на віддих, а потім получив удар по голові. Твої дії:")
            print("1.Переглянути рюкзак     2.Почекати до світанку")
            c = int(input(""))

            if c == 2:
                print("Ви замерзли. Погана кінцівка")
                
            elif c == 1:
                print("Ви найшли ліхтар, запільничку, та топор, ваші дії:")
                print("1.Наколоти дров, та запалити вогнище       2.Освітити локацію")
                q = int(input(""))


                if q == 2:
                    print("Ви розбудили стаю вовків. Погана кінцівка")
                
                elif q == 1:
                    print("Ви розпалили вогнище, та зустріли свого друга, у нього є телефон, ваші дії:")
                    print("1.Подзвонити в поліцію   2.Піти разом вперед")
                    w = int(input(""))
                    if w == 1:
                        print("Поліція вас спасла. Хороша кінцівка")
                    elif w == 2:
                        print("Ви почули звуки, з закинутої лікарні. Хочете зайти? ")
                        print("1.Так     2.Ні")
                        e = int(input(""))
                        if e == 1:
                            print("Там був отруйний павук, підійти до нього?")
                            print("1.Так    2.Ні")
                            r = int(input(""))
                            if r == 2:
                                print("Ви вмерли від голоду. Погана кінцівка")
                            elif r == 1:
                                print("Ви стали людиною-павуком. Особлива кінцівка")
                        elif e == 2:
                            print("Ви зустріли поліцейський участок. Хороша кінцівка")

        elif b == 3:
            print("Ви побачили великого жука, здається це босс, починається бій.")
            print("Він проводить атаку")

            print("1.Постаратися провести атаку      2.Ухилитися")
            t = int(input(""))





            if t == 2:
                print("Ви ухилилися, та нанесли критичний удар.", " HP =", hp - 50)
                print("Ви побачили багато суперників. Ваші дії: ")
                print("1.Втікти    2.Нанести останній удар боссу")
                g = int(input(""))

                if g == 1:
                    print("Вас наздогнали. Погана кінцівка")
                elif g == 2:
                    print("Ви перемогли. Героїчна кінцівка")



            elif t == 1:
                print("Ви провели удар", "HP =", hp - 20)   
                print("Він викликає багато малих противників, ваші дії:")
                print("1.Бігти до босса     2.Перемогти всіх поодинці")
                y = int(input(""))
                if y == 1:
                    print("Ви не встигли. Погана кінцівка")
                elif y == 2:
                    print("Ви перемогли, вони були частиною босса", "HP =", hp - 60)
                    print("Ви побачили шнур, обрізати його?:")
                    print("1.Так     2.Ні")
                    u = int(input(""))
                    if u == 2:
                        print("З часом ви вимоталися, та ви програли. Погана кінцівка")
                    elif u == 1:
                        print("Ви обрізали, на босса впало дерево. Героїчна кінцівка")
except SyntaxError:
    pass

                    